# Data Cleaning

This Jupyter notebook shows you how to perform data cleaning. Download property_data.csv from moodle to the same
directory as this notebook.

### Importing necessary libraries
you can see the documentations of these libraries here.

Pandas : https://pandas.pydata.org/pandas-docs/stable/

Numpy : https://numpy.org/doc/

In [1]:
import pandas as pd
import numpy as np

### Loading the data

Load the data in the property_data.csv into the pandas dataframe, df.

In [2]:
df = pd.read_csv("property_data.csv")

Now we will look at some basic operations that can be performed on the dataframe.

To see the dimensions of the dataframe.

In [3]:
df.shape

(10, 8)

The output shows 10 rows and 8 columns.

To view the first five rows of the dataframe.

In [4]:
df.head()

   PID  ST_NUM    ST_NAME CITY OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0    1   104.0     PUTNAM  NaN            Y            3        1  1000
1    2   197.0  LEXINGTON   NY            N            3      1.5    --
2    3     NaN  LEXINGTON   NY            N          NaN        1   850
3    4   201.0   BERKELEY  NaN           12            1      NaN   700
4    5   203.0   BERKELEY  NaN            Y            3        2  1600

To print the whole dataframe.

In [5]:
df

,PID,ST_NUM,ST_NAME,CITY,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,1,104.0,PUTNAM,NaN,Y,3,1,1000
1,2,197.0,LEXINGTON,NY,N,3,1.5,--
2,3,NaN,LEXINGTON,NY,N,NaN,1,850
3,4,201.0,BERKELEY,NaN,12,1,NaN,700
4,5,203.0,BERKELEY,NaN,Y,3,2,1600
5,6,207.0,BERKELEY,NaN,Y,NaN,1,800
6,7,NaN,WASHINGTON,WASHINGTON DC,NaN,2,HURLEY,950
7,8,213.0,TREMONT,NaN,Y,1,1,NaN
8,9,215.0,TREMONT,NaN,Y,na,2,1800
9,10,216.0,NaN,NaN,Y,1,NaN,NaN

### Identifying null values

We will display all the null values in the data frame.

The following command will display True when a null value is present.

In [6]:
df.isna()

     PID  ST_NUM  ST_NAME   CITY  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False   True         False         False     False  False
1  False   False    False  False         False         False     False  False
2  False    True    False  False         False          True     False  False
3  False   False    False   True         False         False      True  False
4  False   False    False   True         False         False     False  False
5  False   False    False   True         False          True     False  False
6  False    True    False  False          True         False     False  False
7  False   False    False   True         False         False     False   True
8  False   False    False   True         False         False     False  False
9  False   False     True   True         False         False      True   True

If you compare the two last outputs you can see that only NaN is considered as a null value.
However there are other null values such as "na" at index 8 in NUM_BEDROOMS and "--" at index 1 in SQ_FT.
We have to define that "na" and "--" also means null values.

Making a list of missing value types.

In [7]:
missing_values = ["na", "--"]

Now load the data again, but this time we give the null value symbols to the api.

In [8]:
df = pd.read_csv("property_data.csv", na_values = missing_values)
df

,PID,ST_NUM,ST_NAME,CITY,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,1,104.0,PUTNAM,NaN,Y,3.0,1,1000.0
1,2,197.0,LEXINGTON,NY,N,3.0,1.5,NaN
2,3,NaN,LEXINGTON,NY,N,NaN,1,850.0
3,4,201.0,BERKELEY,NaN,12,1.0,NaN,700.0
4,5,203.0,BERKELEY,NaN,Y,3.0,2,1600.0
5,6,207.0,BERKELEY,NaN,Y,NaN,1,800.0
6,7,NaN,WASHINGTON,WASHINGTON DC,NaN,2.0,HURLEY,950.0
7,8,213.0,TREMONT,NaN,Y,1.0,1,NaN
8,9,215.0,TREMONT,NaN,Y,NaN,2,1800.0
9,10,216.0,NaN,NaN,Y,1.0,NaN,NaN

When you print the null values again you can see the difference.

In [9]:
df.isna()

     PID  ST_NUM  ST_NAME   CITY  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False   True         False         False     False  False
1  False   False    False  False         False         False     False   True
2  False    True    False  False         False          True     False  False
3  False   False    False   True         False         False      True  False
4  False   False    False   True         False         False     False  False
5  False   False    False   True         False          True     False  False
6  False    True    False  False          True         False     False  False
7  False   False    False   True         False         False     False   True
8  False   False    False   True         False          True     False  False
9  False   False     True   True         False         False      True   True

You might not be able to catch all of these right away. As you work through the data and see other types of missing 
values, you can add them to the list.

To check if there are any null values in the dataframe. The output is True if there are any null values

In [10]:
df.isnull().values.any()

True

To count the number of null values in the dataframe. The output will be the number of null values in the dataframe.

In [11]:
df.isnull().sum().sum()

19

To count the number of null values in each column. The output will be the number of null values in each column.

In [12]:
df.isnull().sum()

PID             0
ST_NUM          2
ST_NAME         1
CITY            7
OWN_OCCUPIED    1
NUM_BEDROOMS    3
NUM_BATH        2
SQ_FT           3
dtype: int64

### Handling null values

To see the information about each column we can use this command.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           10 non-null     int64
 1   ST_NUM        8 non-null      float64
 2   ST_NAME       9 non-null      object
 3   CITY          3 non-null      object
 4   OWN_OCCUPIED  9 non-null      object
 5   NUM_BEDROOMS  7 non-null      float64
 6   NUM_BATH      8 non-null      object
 7   SQ_FT         7 non-null      float64
dtypes: float64(3), int64(1), object(4)
memory usage: 768.0+ bytes

Here you can see how many non null values each column has and the data type in each column

You can notice that CITY has only three non-null values. That is 7 values out of 10 are null. So this feature will not 
help our algorithm. In this case we can delete the entire column.

In [14]:
to_drop = ['CITY']
df.drop(to_drop, inplace=True, axis=1)

Now we will print the head of the dataframe and you can notice that CITY is deleted

In [15]:
df.head()

   PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0    1   104.0     PUTNAM            Y           3.0        1  1000.0
1    2   197.0  LEXINGTON            N           3.0      1.5     NaN
2    3     NaN  LEXINGTON            N           NaN        1   850.0
3    4   201.0   BERKELEY           12           1.0      NaN   700.0
4    5   203.0   BERKELEY            Y           3.0        2  1600.0

We will count the number of values in each row to check whether there are any rows that we can delete completely 
because they contain more null values.

In [16]:
df.apply(lambda x: x.count(), axis=1)

0    7
1    6
2    5
3    6
4    7
5    6
6    5
7    6
8    6
9    4
dtype: int64

Here the lambda Function we defined applied to each column or row. In this case it is count()
axis : {0 or ‘index’, 1 or ‘columns’}, default 0
Axis along which the function is applied:
       0 or ‘index’: apply function to each column.
      1 or ‘columns’: apply function to each row.
      
Read more about python lambda function here.
https://docs.python.org/3/tutorial/controlflow.html#lambda-expressions

The first column gives you the index of each row and the second column gives you the number of values in each row.
Notice that row with index 9 has only 4 values. So this data instance can negatively affect our learning algorithm. 
Therefore We can delete that row.

In [17]:
df=df.drop([9])

In [18]:
# Print the data frame
df

   PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0    1   104.0      PUTNAM            Y           3.0        1  1000.0
1    2   197.0   LEXINGTON            N           3.0      1.5     NaN
2    3     NaN   LEXINGTON            N           NaN        1   850.0
3    4   201.0    BERKELEY           12           1.0      NaN   700.0
4    5   203.0    BERKELEY            Y           3.0        2  1600.0
5    6   207.0    BERKELEY            Y           NaN        1   800.0
6    7     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7    8   213.0     TREMONT            Y           1.0        1     NaN
8    9   215.0     TREMONT            Y           NaN        2  1800.0

You can see that the row with index 9 has been deleted.

Let's get the null value count of each column.

In [19]:
df.isnull().sum()

PID             0
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

Now we will take column by column and replace the null values by meaningful data.

First lets consider "ST_NUM". There are two null values. We will replace them by 125.
The fillna will fill the "ST_NUM" column with 125 when it has a null value

In [20]:
df['ST_NUM'].fillna(125, inplace=True)
df['ST_NUM']

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

The next column with null values is "OWN_OCCUPIED".

In [21]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

You can see a 12 at index 3 and a null value at index 6. The value here should be either "Y" or "N".
We will check whether 12 is taken as null

In [22]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

You can see that 12 is not considered as null. So we will convert it into null.There are several approaches to do this. 
Our approach is

    1) Loop through the OWN_OCCUPIED column
    2) Try and turn the entry into an integer
    3) If the entry can be changed into an integer, enter a missing value
    4) If the number can’t be an integer, we know it’s a string, so keep going

In [23]:
# Detecting numbers
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

In the code we’re looping through each entry in the “Owner Occupied” column. To try and change the entry to an integer, 
we’re using int(row).

If the value can be changed to an integer, we change the entry to a missing value using Numpy’s np.nan.

On the other hand, if it can’t be changed to an integer, we pass and keep going.

You’ll notice that I used try and except ValueError. This is called exception handling, and we use this to handle errors.

If we were to try and change an entry into an integer and it couldn’t be changed, then a ValueError would be returned, 
and the code would stop. To deal with this, we use exception handling to recognize these errors, and keep going.

Another important bit of the code is the .loc method. This is the preferred Pandas method for modifying entries in place. 
For more info on this you can check out the Pandas documentation.

When you print the null values in the "OWN_OCCUPIED" you can see that index 3 has turn into null

In [24]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [25]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

Now we can replace the null values by "Y" or "N"

In [26]:
df['OWN_OCCUPIED'].fillna('Y', inplace=True)
df['OWN_OCCUPIED']

0    Y
1    N
2    N
3    Y
4    Y
5    Y
6    Y
7    Y
8    Y
Name: OWN_OCCUPIED, dtype: object

### Task 1
Similarly clean the data in the "NUM_BEDROOMS", "NUM_BATH" and "SQ_FT" columns.

"NUM_BEDROOMS" and "NUM_BATH" should be integers

Null values in "SQ_FT" should be filled by the median of "SQ_FT"

Save the resultant dataframe as property_data1.csv 

All the errors you are seeing in the second part of this notebook will be **fixed** after you **complete** this task.

### Data Analyzing

We can use pandas library to do an analysis on our data.

Let's take few simple examples.

* Mean value of a feature

In [27]:
#Mean number of bedrooms
mean1 = df['NUM_BEDROOMS'].mean()
print('Mean number of bedrooms: '+ str(mean1))

Mean number of bedrooms: 2.1666666666666665

* Sum of all values in a feature

In [28]:
#Sum of bathrooms
sum1 = df['NUM_BATH'].sum()
print('Sum of bathrooms: '+ str(sum1))

TypeError: can only concatenate str (not "int") to str

* Maximum and minimum value of a feature

In [ ]:
#Maximum number of bedroom
max1 = df['NUM_BEDROOMS'].max()
print('Maximum number of bedrooms: '+ str(max1))

#Minimum number of bedroom
min1 = df['NUM_BEDROOMS'].min()
print('Minimum number of bedrooms: '+ str(min1))

* Count number of data points in a feature

In [27]:
#Count the number of students
count1 = df['ST_NUM'].count()
print('Count of students: '+ str(count1))

Count of students: 9

* Variance and standard deviation of the data in a feature

In [ ]:
# std
std1 = df['SQ_FT'].std()
print('Standard deviation of square feet: '+ str(std1))

# variance
var1 = df['SQ_FT'].var()
print('Variance of square feet: '+ str(var1))

* Median of a feature

In [ ]:
# median
median1 = df['SQ_FT'].median()
print('Median of square feet: '+ str(median1))

#### Grouping

Sometimes when analyzing our data, we might need to group the data according to some feature.

For an example let us say that we need to see how much data instances we have for each class. This is a very common 
practice because unbalanced datasets can lead to biased results.

We can do this by grouping the dataset by the target class, and get the count of instances in each class. Let us assume 
that 'OWN_OCCUPIED' is our target. So we have two classes, 'Y' and 'N'.

In [29]:
# Number of instances, grouped by the owner occupied
groupby_count1 = df.groupby('OWN_OCCUPIED')['PID'].count()
print ('Number of instances, grouped by the owner occupied: ' + str(groupby_count1))

Number of instances, grouped by the owner occupied: OWN_OCCUPIED
N    2
Y    7
Name: PID, dtype: int64

We can see that we have very unbalanced dataset from this output.

#### Adding new features

Sometimes if we combine multiple features and create a new feature, it can boost up the accuracy of the machine 
learning model. With pandas dataframes, it is really easy to create new features.

Let us create a new feature called 'NUM_ROOMS' which will have the sum of bedrooms and bathrooms in a property.

In [30]:
#Sum of bedrooms and bathrooms in each house
allrooms = (df.NUM_BEDROOMS + df.NUM_BATH)
df['All_Rooms'] = allrooms
df['All_Rooms']

TypeError: unsupported operand type(s) for +: 'float' and 'str'

Let's see our modified and cleaned dataset.

In [31]:
df

   PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0    1   104.0      PUTNAM            Y           3.0        1  1000.0
1    2   197.0   LEXINGTON            N           3.0      1.5     NaN
2    3   125.0   LEXINGTON            N           NaN        1   850.0
3    4   201.0    BERKELEY            Y           1.0      NaN   700.0
4    5   203.0    BERKELEY            Y           3.0        2  1600.0
5    6   207.0    BERKELEY            Y           NaN        1   800.0
6    7   125.0  WASHINGTON            Y           2.0   HURLEY   950.0
7    8   213.0     TREMONT            Y           1.0        1     NaN
8    9   215.0     TREMONT            Y           NaN        2  1800.0

### TASK 2
Create a Data quality report for this dataset. You will find a sample data quality report on your Week 1 lecture slides.